''' Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый,
зеленый. Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды,
третьего (зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном
порядке (красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.
Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее сообщение и завершать скрипт. '''

import time

class TrafficLight:
    __color: str
    def running(self, interval):
        while True:
            self.__color = 'красный'
            print(self.__color)
            time.sleep(interval[0])
            self.__color = 'желтый'
            print(self.__color)
            time.sleep(interval[1])
            self.__color = 'зелёный'
            print(self.__color)
            time.sleep(interval[2])

TrafficLight_obj = TrafficLight().running([7, 2, 14])
